import {
	Shield,
	Crosshair,
	HeartPulse,
	UserCheck,
	Briefcase,
	Bomb,
	HatGlasses,
	User
} from 'lucide-svelte';

export const gameRules = [
	{
		title: 'Розподіл ролей',
		description:
			'Почнемо з того, що всі гравці отримують свої ролі. Є дві основні групи ролей: мафія і мирні мешканці. Мафія діє у таємниці та намагається залишати свою ідентичність прихованою, в той час як мирні мешканці намагаються розкрити мафію.'
	},
	{
		title: 'Нічні раунди',
		description:
			'Гра складається з нічних і денних раундів. У нічному раунді мафія збирається і вибирає свою жертву. Решта гравців ролі не розкривають і спостерігають, що відбувається під час ночі.'
	},
	{
		title: 'Денні раунди',
		description:
			' денний час гравці обговорюють події, які сталися під час ночі, та вирішують, кого вони вважають членом мафії. Голосування проводиться з метою виключити гравця з гри. Особа з найбільшою кількістю голосів вилучається з гри, і її роль розкривається.'
	},
	{
		title: 'Перемога',
		description:
			'Гра триває до тих пір, поки одна з груп не переможе. Якщо мафія зможе видалити всіх мирних мешканців, вони переможуть.Якщо мирні мешканці викривають всіх членів мафії, вони переможуть.Гра завершується, коли досягається ця умова.'
	}
];

export const bigDescriptionList = {
	mans: {
		description:
			'Персонажі, що виживають у боротьбі з мафією і намагаються вивести її на чисту воду. Відбір кандидатів на роль мафії відбувається під час денного голосування.',
		icon: User,
		name: 'Мирний'
	},
	mafias: {
		description:
			'Злочинці, що діють у нічний час та скоюють вбивства городян. Вдень персонаж зливається з натовпом і виглядає як звичайний мешканець. Знаком пробудження гангстерів стає фраза ведучого «місто засинає, прокидається «мафія» чи його аналоги. Після її виголошення члени мафіозного клану знайомляться між собою та домовляються про майбутні жертви.',
		icon: HatGlasses,
		name: 'Мафія'
	},
	doctor: {
		description:
			'Персонаж із числа мирних жителів, здатний вилікувати вибраного горожанина. Прокидається він після дій мафії і здатний спасти від гибелі одного з гравців у разі вдалого попадання. Одного персонажа не можна лікувати дві ночі підряд!',
		icon: HeartPulse,
		name: 'Лікар'
	},
	cop: {
		description:
			'Персонаж прокидається вночі, щоб визначити серед учасників мафію. Ця інформація допомагає йому вплинути на рішення громадян у денному голосуванні. Втім, героєві не можна видати себе, щоб мафія не обрала його наступною нічною жертвою.',
		icon: Shield,
		name: 'Шериф'
	},
	maniac: {
		description:
			'Вбиває учасників, але не належить до жодного угруповання. Вночі обирає собі жертву як серед мафії, і серед городян.',
		icon: Crosshair,
		name: 'Маньяк'
	},
	kamikaze: {
		description:
			'Якщо Камікадзе був вбитий мафією або вилучений під час голосування, то він вибирає одного з інших гравців, якого забере із собою на той світ.',
		icon: Bomb,
		name: 'Камікадзе'
	},
	security: {
		description:
			'Гравець, який обирає і захищає іншого гравця від можливої атаки мафії. Якщо Охоронець правильно вибере ціль мафії, то він сам гине, а обрана ним жертва залишається живою.',
		icon: UserCheck,
		name: 'Охоронець'
	},
	lawyer: {
		description:
			'Він може вказати на іншого гравця протягом ночі, вибраний гравець не може бути обрана жертвою на наступний день пíд час голосування. Адвокат здатний забезпечити безпеку, дозволяючи іншому вижити вíд лíнчування та продовжити гру. Одного персонажа не можна захищати двi ночi пiдряд!',
		icon: Briefcase,
		name: 'Адвокат'
	}
};

export const cardList =
	//Spreites in the static folder must have the same word as in this list, also tags must be the same as in the bigDescriptionList
	[
		{
			description: 'Квасний Сас',
			myImg: 'Man1',
			tag: 'mans',
			id: 0
		},
		{
			description: 'Ти коли таким бандитом став?',
			myImg: 'Man2',
			tag: 'mans',
			id: 1
		},
		{
			description: 'Та я мириний мен',
			myImg: 'Man3',
			tag: 'mans',
			id: 2
		},
		{
			description: 'Майнкрафт - топ!!!',
			myImg: 'Man4',
			tag: 'mans',
			id: 3
		},
		{
			description: 'Гра-мафія за 3 дня!',
			myImg: 'Man5',
			tag: 'mans',
			id: 4
		},
		{
			description: 'Якщо тобі не сподобається стрижка, то ...',
			myImg: 'Mafia1',
			tag: 'mafias',
			id: 5
		},
		{
			description: 'Ільящер',
			myImg: 'Mafia2',
			tag: 'mafias',
			id: 6
		},
		{
			description: 'Мото-мото в клубі',
			myImg: 'Mafia3',
			tag: 'mafias',
			id: 7
		},
		{
			description: 'Sangre por sangre',
			myImg: 'Mafia4',
			tag: 'mafias',
			id: 8
		},
		{
			description: 'Вам пора в дурка',
			myImg: 'Doctor',
			tag: 'doctor',
			id: 9
		},
		{
			description: 'Чорний плащ! Чооорний плащ',
			myImg: 'Commissar',
			tag: 'cop',
			id: 10
		},
		{
			description: 'Я йду за тобою!',
			myImg: 'Maniac',
			tag: 'maniac',
			id: 11
		},
		{
			description: 'Завжди було цікаво - що якщо зʼїсти карсар 1',
			myImg: 'Kamikaze',
			tag: 'kamikaze',
			id: 12
		},
		{
			description: 'Тобі потрібно більше тренеруватися!',
			myImg: 'Security',
			tag: 'security',
			id: 13
		},
		{
			description: 'Better call Saul',
			myImg: 'Lawyer',
			tag: 'lawyer',
			id: 14
		}
	];
